// ignore_for_file: constant_identifier_names

const Map<String, Map<String, double>> lengthConversionFactors = {
  'אצבעות': {
    'אצבעות': 1,
    'טפחים': 1 / 4,
    'זרתות': 1 / 12,
    'אמות': 1 / 24,
    'קנים': 1 / 144,
    'מילים': 1 / 48000,
    'פרסאות': 1 / 192000,
  },
  'טפחים': {
    'אצבעות': 4,
    'טפחים': 1,
    'זרתות': 1 / 3,
    'אמות': 1 / 6,
    'קנים': 1 / 36,
    'מילים': 1 / 12000,
    'פרסאות': 1 / 48000,
  },
  'זרתות': {
    'אצבעות': 12,
    'טפחים': 3,
    'זרתות': 1,
    'אמות': 1 / 2,
    'קנים': 1 / 12,
    'מילים': 1 / 4000,
    'פרסאות': 1 / 16000,
  },
  'אמות': {
    'אצבעות': 24,
    'טפחים': 6,
    'זרתות': 2,
    'אמות': 1,
    'קנים': 1 / 6,
    'מילים': 1 / 2000,
    'פרסאות': 1 / 8000,
  },
  'קנים': {
    'אצבעות': 144,
    'טפחים': 36,
    'זרתות': 12,
    'אמות': 6,
    'קנים': 1,
    'מילים': 1 / (333 + 1 / 3),
    'פרסאות': 1 / (1333 + 1 / 3),
  },
  'מילים': {
    'אצבעות': 48000,
    'טפחים': 12000,
    'זרתות': 4000,
    'אמות': 2000,
    'קנים': 333 + 1 / 3,
    'מילים': 1,
    'פרסאות': 1 / 4,
  },
  'פרסאות': {
    'אצבעות': 192000,
    'טפחים': 48000,
    'זרתות': 16000,
    'אמות': 8000,
    'קנים': 1333 + 1 / 3,
    'מילים': 4,
    'פרסאות': 1,
  },
};

const Map<String, Map<String, double>> modernLengthFactors = {
  'רמב"ם': {
    'אצבע': 1.9, // cm
    'טפח': 7.6, // cm
    'זרת': 22.8, // cm
    'אמה': 45.6, // cm
    'קנה': 2.736, // m
    'מיל': 912, // m
    'פרסה': 3.648, // km
  },
  'רא"ח נאה': {
    'אצבע': 2, // cm
    'טפח': 8, // cm
    'זרת': 24, // cm
    'אמה': 48, // cm
    'קנה': 2.88, // m
    'מיל': 960, // m
    'פרסה': 3.84, // km
  },
  'אגרות משה': {
    'אצבע': 2.25, // cm
    'טפח': 9, // cm
    'זרת': 27, // cm
    'אמה': 54, // cm
    'קנה': 3.24, // m
    'מיל': 1080, // m
    'פרסה': 4.32, // km
  },
  'צל"ח': {
    'אצבע': 2.34, // cm
    'טפח': 9.36, // cm
    'זרת': 28.08, // cm
    'אמה': 56.16, // cm
    'קנה': 3.37, // m
    'מיל': 1123, // m
    'פרסה': 4.493, // km
  },
  'חזון איש': {
    'אצבע': 2.4, // cm
    'טפח': 9.6, // cm
    'זרת': 28.8, // cm
    'אמה': 57.6, // cm
    'קנה': 3.456, // m
    'מיל': 1152, // m
    'פרסה': 4.608, // km
  },
  'חתם סופר': {
    'אצבע': 2.7, // cm
    'טפח': 10.8, // cm
    'זרת': 32.4, // cm
    'אמה': 64.8, // cm
    'קנה': 3.888, // m
    'מיל': 1296, // m
    'פרסה': 5.184, // km
  },
};

const Map<String, Map<String, double>> areaConversionFactors = {
  'בית רובע': {
    'בית רובע': 1,
    'בית קב': 1 / 4,
    'בית סאה': 1 / 24,
    'בית סאתיים': 1 / 48,
    'בית לתך': 1 / 360,
    'בית כור': 1 / 720,
  },
  'בית קב': {
    'בית רובע': 4,
    'בית קב': 1,
    'בית סאה': 1 / 6,
    'בית סאתיים': 1 / 12,
    'בית לתך': 1 / 90,
    'בית כור': 1 / 180,
  },
  'בית סאה': {
    'בית רובע': 24,
    'בית קב': 6,
    'בית סאה': 1,
    'בית סאתיים': 1 / 2,
    'בית לתך': 1 / 15,
    'בית כור': 1 / 30,
  },
  'בית סאתיים': {
    'בית רובע': 48,
    'בית קב': 12,
    'בית סאה': 2,
    'בית סאתיים': 1,
    'בית לתך': 1 / 7.5,
    'בית כור': 1 / 15,
  },
  'בית לתך': {
    'בית רובע': 360,
    'בית קב': 90,
    'בית סאה': 15,
    'בית סאתיים': 7.5,
    'בית לתך': 1,
    'בית כור': 1 / 2,
  },
  'בית כור': {
    'בית רובע': 720,
    'בית קב': 180,
    'בית סאה': 30,
    'בית סאתיים': 15,
    'בית לתך': 2,
    'בית כור': 1,
  },
};

const Map<String, double> areaInSquareAmot = {
  'בית רובע': 104 + 1 / 6,
  'בית קב': 416 + 2 / 3,
  'בית סאה': 2500,
  'בית סאתיים': 5000,
  'בית לתך': 37500,
  'בית כור': 75000,
};

const Map<String, Map<String, double>> modernAreaFactors = {
  'רמב"ם': {
    'בית רובע': 21 + 2 / 3, // m^2
    'בית קב': 86 + 2 / 3, // m^2
    'בית סאה': 520, // m^2
    'בית סאתיים': 1.04, // dunam
    'בית לתך': 7.8, // dunam
    'בית כור': 15.6, // dunam
  },
  'רא"ח נאה': {
    'בית רובע': 24, // m^2
    'בית קב': 96, // m^2
    'בית סאה': 576, // m^2
    'בית סאתיים': 1.152, // dunam
    'בית לתך': 8.64, // dunam
    'בית כור': 17.28, // dunam
  },
  'אגרות משה': {
    'בית רובע': 30 + 3 / 8, // m^2
    'בית קב': 121.5, // m^2
    'בית סאה': 729, // m^2
    'בית סאתיים': 1.458, // dunam
    'בית לתך': 10.935, // dunam
    'בית כור': 21.87, // dunam
  },
  'צל"ח': {
    'בית רובע': 32.85, // m^2
    'בית קב': 131.4, // m^2
    'בית סאה': 788.5, // m^2
    'בית סאתיים': 1.577, // dunam
    'בית לתך': 11.827, // dunam
    'בית כור': 23.655, // dunam
  },
  'חזון איש': {
    'בית רובע': 34.56, // m^2
    'בית קב': 138 + 1 / 4, // m^2
    'בית סאה': 829.5, // m^2
    'בית סאתיים': 1.659, // dunam
    'בית לתך': 12.442, // dunam
    'בית כור': 24.883, // dunam
  },
  'חתם סופר': {
    'בית רובע': 43 + 3 / 4, // m^2
    'בית קב': 175, // m^2
    'בית סאה': 1.05, // dunam
    'בית סאתיים': 2.1, // dunam
    'בית לתך': 15.746, // dunam
    'בית כור': 31.493, // dunam
  },
};

const Map<String, Map<String, double>> volumeConversionFactors = {
  'רביעיות': {
    'רביעיות': 1,
    'לוגים': 1 / 4,
    'קבים': 1 / 16,
    'עשרונות': 1 / 28.8,
    'הינים': 1 / 48,
    'סאים': 1 / 96,
    'איפות': 1 / 288,
    'לתכים': 1 / 1440,
    'כורים': 1 / 2880,
  },
  'לוגים': {
    'רביעיות': 4,
    'לוגים': 1,
    'קבים': 1 / 4,
    'עשרונות': 1 / 7.2,
    'הינים': 1 / 12,
    'סאים': 1 / 24,
    'איפות': 1 / 72,
    'לתכים': 1 / 360,
    'כורים': 1 / 720,
  },
  'קבים': {
    'רביעיות': 16,
    'לוגים': 4,
    'קבים': 1,
    'עשרונות': 1 / 1.8,
    'הינים': 1 / 3,
    'סאים': 1 / 6,
    'איפות': 1 / 18,
    'לתכים': 1 / 90,
    'כורים': 1 / 180,
  },
  'עשרונות': {
    'רביעיות': 28.8,
    'לוגים': 7.2,
    'קבים': 1.8,
    'עשרונות': 1,
    'הינים': 1 / (1 + 2 / 3),
    'סאים': 1 / (3 + 1 / 3),
    'איפות': 1 / 10,
    'לתכים': 1 / 50,
    'כורים': 1 / 100,
  },
  'הינים': {
    'רביעיות': 48,
    'לוגים': 12,
    'קבים': 3,
    'עשרונות': 1 + 2 / 3,
    'הינים': 1,
    'סאים': 1 / 2,
    'איפות': 1 / 6,
    'לתכים': 1 / 30,
    'כורים': 1 / 60,
  },
  'סאים': {
    'רביעיות': 96,
    'לוגים': 24,
    'קבים': 6,
    'עשרונות': 3 + 1 / 3,
    'הינים': 2,
    'סאים': 1,
    'איפות': 1 / 3,
    'לתכים': 1 / 15,
    'כורים': 1 / 30,
  },
  'איפות': {
    'רביעיות': 288,
    'לוגים': 72,
    'קבים': 18,
    'עשרונות': 10,
    'הינים': 6,
    'סאים': 3,
    'איפות': 1,
    'לתכים': 1 / 5,
    'כורים': 1 / 10,
  },
  'לתכים': {
    'רביעיות': 1440,
    'לוגים': 360,
    'קבים': 90,
    'עשרונות': 50,
    'הינים': 30,
    'סאים': 15,
    'איפות': 5,
    'לתכים': 1,
    'כורים': 1 / 2,
  },
  'כורים': {
    'רביעיות': 2880,
    'לוגים': 720,
    'קבים': 180,
    'עשרונות': 100,
    'הינים': 60,
    'סאים': 30,
    'איפות': 10,
    'לתכים': 2,
    'כורים': 1,
  },
};

const Map<String, Map<String, double>> modernVolumeFactors = {
  'רמב"ם': {
    'רביעית': 76.4, // cm^3
    'לוג': 305.6, // cm^3
    'קב': 1.22, // L
    'עשרון': 2.2, // L
    'הין': 3.67, // L
    'סאה': 7.34, // L
    'איפה': 22, // L
    'לתך': 110, // L
    'כור': 220, // L
  },
  'רא"ח נאה': {
    'רביעית': 86.5, // cm^3
    'לוג': 346, // cm^3
    'קב': 1.38, // L
    'עשרון': 2.5, // L
    'הין': 4.15, // L
    'סאה': 8.3, // L
    'איפה': 24.9, // L
    'לתך': 124.5, // L
    'כור': 249, // L
  },
  'אגרות משה': {
    'רביעית': 123, // cm^3
    'לוג': 492, // cm^3
    'קב': 1.97, // L
    'עשרון': 3.5, // L
    'הין': 5.9, // L
    'סאה': 11.8, // L
    'איפה': 35.4, // L
    'לתך': 177, // L
    'כור': 354, // L
  },
  'צל"ח': {
    'רביעית': 139, // cm^3
    'לוג': 556, // cm^3
    'קב': 2.22, // L
    'עשרון': 4, // L
    'הין': 6.67, // L
    'סאה': 13.34, // L
    'איפה': 40, // L
    'לתך': 200, // L
    'כור': 400, // L
  },
  'חזון איש': {
    'רביעית': 149.3, // cm^3
    'לוג': 597.2, // cm^3
    'קב': 2.4, // L
    'עשרון': 4.3, // L
    'הין': 7.2, // L
    'סאה': 14.3, // L
    'איפה': 43, // L
    'לתך': 215, // L
    'כור': 430, // L
  },
  'חתם סופר': {
    'רביעית': 212.6, // cm^3
    'לוג': 850.4, // cm^3
    'קב': 3.4, // L
    'עשרון': 6.12, // L
    'הין': 10.2, // L
    'סאה': 20.4, // L
    'איפה': 61.2, // L
    'לתך': 306, // L
    'כור': 612, // L
  },
};

// Ancient time units conversion factors (between ancient units)
const Map<String, Map<String, double>> timeConversionFactors = {
  'הילוך ארבע אמות': {
    'הילוך ארבע אמות': 1,
    'הילוך מאה אמה': 1 / 25,
    'הילוך שלושה רבעי מיל': 1 / 375,
    'הילוך מיל': 1 / 500,
    'הילוך ארבעה מילים': 1 / 2000,
  },
  'הילוך מאה אמה': {
    'הילוך ארבע אמות': 25,
    'הילוך מאה אמה': 1,
    'הילוך שלושה רבעי מיל': 1 / 15,
    'הילוך מיל': 1 / 20,
    'הילוך ארבעה מילים': 1 / 80,
  },
  'הילוך שלושה רבעי מיל': {
    'הילוך ארבע אמות': 375,
    'הילוך מאה אמה': 15,
    'הילוך שלושה רבעי מיל': 1,
    'הילוך מיל': 1 / (1 + 1/3),
    'הילוך ארבעה מילים': 1 / (5 + 1/3),
  },
  'הילוך מיל': {
    'הילוך ארבע אמות': 500,
    'הילוך מאה אמה': 20,
    'הילוך שלושה רבעי מיל': 1 + 1/3,
    'הילוך מיל': 1,
    'הילוך ארבעה מילים': 1 / 4,
  },
  'הילוך ארבעה מילים': {
    'הילוך ארבע אמות': 2000,
    'הילוך מאה אמה': 80,
    'הילוך שלושה רבעי מיל': 5 + 1/3,
    'הילוך מיל': 4,
    'הילוך ארבעה מילים': 1,
  },
};

// Modern time conversion factors (ancient units to modern units)
const Map<String, Map<String, double>> modernTimeFactors = {
  'שולחן ערוך': {
    'הילוך ארבע אמות': 2.16, // seconds
    'הילוך מאה אמה': 54, // seconds
    'הילוך שלושה רבעי מיל': 13.5 * 60, // seconds
    'הילוך מיל': 18 * 60, // seconds
    'הילוך ארבעה מילים': 72 * 60, // seconds
  },
  'גר"א וחתם סופר': {
    'הילוך ארבע אמות': 2.7, // seconds
    'הילוך מאה אמה': 67.5, // seconds
    'הילוך שלושה רבעי מיל': (16 * 60) + 52.51, // seconds
    'הילוך מיל': 22.5 * 60, // seconds
    'הילוך ארבעה מילים': 90 * 60, // seconds
  },
  'רמב"ם': {
    'הילוך ארבע אמות': 2.88, // seconds
    'הילוך מאה אמה': 72, // seconds
    'הילוך שלושה רבעי מיל': 18 * 60, // seconds
    'הילוך מיל': 24 * 60, // seconds
    'הילוך ארבעה מילים': 96 * 60, // seconds
  },
};

const Map<String, Map<String, double>> weightConversionFactors = {
  'דינרים': {
    'דינרים': 1,
    'שקלים': 1 / 2,
    'סלעים': 1 / 4,
    'טרטימרים': 1 / 50,
    'מנים': 1 / 100,
    'ככרות': 1 / 6000,
    'קנטרים': 1 / 10000,
  },
  'שקלים': {
    'דינרים': 2,
    'שקלים': 1,
    'סלעים': 1 / 2,
    'טרטימרים': 1 / 25,
    'מנים': 1 / 50,
    'ככרות': 1 / 3000,
    'קנטרים': 1 / 5000,
  },
  'סלעים': {
    'דינרים': 4,
    'שקלים': 2,
    'סלעים': 1,
    'טרטימרים': 1 / 12.5,
    'מנים': 1 / 25,
    'ככרות': 1 / 1500,
    'קנטרים': 1 / 2500,
  },
  'טרטימרים': {
    'דינרים': 50,
    'שקלים': 25,
    'סלעים': 12.5,
    'טרטימרים': 1,
    'מנים': 1 / 2,
    'ככרות': 1 / 120,
    'קנטרים': 1 / 200,
  },
  'מנים': {
    'דינרים': 100,
    'שקלים': 50,
    'סלעים': 25,
    'טרטימרים': 2,
    'מנים': 1,
    'ככרות': 1 / 60,
    'קנטרים': 1 / 100,
  },
  'ככרות': {
    'דינרים': 6000,
    'שקלים': 3000,
    'סלעים': 1500,
    'טרטימרים': 120,
    'מנים': 60,
    'ככרות': 1,
    'קנטרים': 1 / (1 + 2 / 3),
  },
  'קנטרים': {
    'דינרים': 10000,
    'שקלים': 5000,
    'סלעים': 2500,
    'טרטימרים': 200,
    'מנים': 100,
    'ככרות': 1 + 2 / 3,
    'קנטרים': 1,
  },
};

const Map<String, Map<String, double>> modernWeightFactors = {
  'רש"י': {
    'דינר': 3.54, // g
    'שקל': 7.08, // g
    'סלע': 14.16, // g
    'טרטימר': 177, // g
    'מנה': 354, // g
    'כיכר': 21.24, // kg
    'קנטר': 35.4, // kg
  },
  'ר"ם מ"ץ': {
    'דינר': 3.84, // g
    'שקל': 7.67, // g
    'סלע': 15.34, // g
    'טרטימר': 192, // g
    'מנה': 384, // g
    'כיכר': 23.04, // kg
    'קנטר': 38.4, // kg
  },
  'ש"ך': {
    'דינר': 3.95, // g
    'שקל': 7.9, // g
    'סלע': 15.8, // g
    'טרטימר': 197, // g
    'מנה': 395, // g
    'כיכר': 23.7, // kg
    'קנטר': 39.5, // kg
  },
  'גאונים ורמב"ם': {
    'דינר': 4.25, // g
    'שקל': 8.5, // g
    'סלע': 17, // g
    'טרטימר': 212.5, // g
    'מנה': 425, // g
    'כיכר': 25.5, // kg
    'קנטר': 42.5, // kg
  },
  'בירורי המידות והשיעורין': {
    'דינר': 4.36, // g
    'שקל': 8.72, // g
    'סלע': 17.44, // g
    'טרטימר': 218, // g
    'מנה': 436, // g
    'כיכר': 26.16, // kg
    'קנטר': 43.6, // kg
  },
  'הליכות עולם (לר"ע יוסף)': {
    'דינר': 4.5, // g
    'שקל': 9, // g
    'סלע': 18, // g
    'טרטימר': 225, // g
    'מנה': 450, // g
    'כיכר': 27, // kg
    'קנטר': 45, // kg
  },
  'חזון איש ורא"ח נאה': {
    'דינר': 4.8, // g
    'שקל': 9.6, // g
    'סלע': 19.2, // g
    'טרטימר': 240, // g
    'מנה': 480, // g
    'כיכר': 28.8, // kg
    'קנטר': 48, // kg
  },
};
